---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkRoomOverlapMain
source: html/aac4d444-df89-cb31-3c00-6acbf4924318.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkRoomOverlapMain Property

Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room in the Revit link's option '[Option Name in Link]' overlaps a room in the main model.\nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictInLinkRoomOverlapMain { get; }
```